src/main/resources/template/kafkaSapXmlTemplate.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header/>
    <soap:Body>
        <XacuteRequest xmlns="http://www.sap.com/xMII">
            <LoginName/>${login_name}
            <LoginPassword/>${login_password}
            <InputParams>
                <input>${message}</input>
            </InputParams>
        </XacuteRequest>
    </soap:Body>
</soap:Envelope>
